<?php

$lang['required']           = "حقل %s يجب ملؤه.";
$lang['isset']              = "حقل %s يجب أن يحتوي على قيمة.";
$lang['valid_email']        = "حقل %s يجب أن يحتوي على بريد إلكتروني.";
$lang['valid_emails']       = "حقل %s يجب أن يحتوي على العديد من العناوين البريدية.";
$lang['valid_url']          = "حقل %s يجب أن يحتوي على رابط.";
$lang['valid_ip']           = "حقل %s يجب اي يحتوي على IP صحيح.";
$lang['min_length']         = "حقل %s يجب أن يحتوي على الأقل على %s محارف.";
$lang['max_length']         = "حقل %s لا يتجاوز %s محارف.";
$lang['greater_than']       = "حقل %s يجب أن يكون أكبر من %s.";
$lang['less_than']          = "حقل %s يجب أن أقل من  %s.";
$lang['exact_length']       = "حقل %s يجب ان يحتوي بالضبط على  %s حروف.";
$lang['alpha']              = "حقل %s يجب أن يحتوي على حروف فقط.";
$lang['alpha_numeric']      = "حقل %s يجب أن يحتوي على أحرف أو أعداد فقط.";
$lang['alpha_dash']         = "حقل %s يجب أن يحتوي فقط على أحرف و أعداد و محرف (-) أو محرف (_).";
$lang['numeric']            = "حقل %s يجب أن يحتوي فقط على أعداد.";
$lang['is_numeric']         = "حقل %s يجب أن يحتوي فقط على أعداد صحيحة.";
$lang['integer']            = "حقل %s يجب أن يحتوي على اعداد صحيحة فقط.";
$lang['regex_match']        = "حقل %s ليس بالصيغة الصحيحة.";
$lang['matches']            = "حقل %s ليس مماثل لحقل %s .";
$lang['is_natural']         = "حقل %s يجب أن يحتوي فقط على اعداد موجبة فقط.";
$lang['is_natural_no_zero'] = "حقل %s يجب أن يحتوي على أعداد أكبر من صفر فقط.";

